Revit 2018 API
View.ViewName Property
The name of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public string ViewName { get; set; }
Visual Basic
Public Property ViewName As String
	Get
	Set
Visual C++
public:
property String^ ViewName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the name provided already exists, or is invalid for this view.
See Also
View Class
Autodesk.Revit.DB Namespace